---
type: FabricationSaveJobOptions
namespace: Autodesk.Revit.DB.Fabrication
version: 2024
members: 5
tags: [revit-api, class]
---

# FabricationSaveJobOptions

`Autodesk.Revit.DB.Fabrication.FabricationSaveJobOptions` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FabricationSaveJobOptions | — | `` |
| Constructor | FabricationSaveJobOptions | 2019 | `public FabricationSaveJobOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | AddHolesForTaps | 2019 | `public bool AddHolesForTaps { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |